# Introduction

- Normally, we would be doing our querying in a DBMS, but for the sake of showcasing, SQL queries on this database will be done in Jupyter Labs
- To run SQL queries in Jupyter, we have to add %%sql on its own line to the start of our query.
- We'll be doing this for every query we make, and are using jupyter for reproducability.

## Connecting to database and installing necessary packages

In [16]:
# import necessary packages
import pandas as pd
import sqlite3

In [19]:
# This is the workflow for working with SQL in python. You have to:
# establish a connection to the database
# instantiate a cursor class to "navigate" the database
# execute queries on the database using the cursor, combining SQL and python to do so.

conn = sqlite3.connect("factbook.db")
q1 = "SELECT * FROM sqlite_master WHERE type='table';"
r = conn.cursor()

# turning the results of every query into a pandas dataframe makes it more readable.
pd.read_sql_query(q1, conn)

,type,name,tbl_name,rootpage,sql
0,table,sqlite_sequence,sqlite_sequence,3,"CREATE TABLE sqlite_sequence(name,seq)"
1,table,facts,facts,47,"CREATE TABLE ""facts"" (""id"" INTEGER PRIMARY KEY..."

# Overview of the Data

In [20]:
# let's take a look at the first five rows of the db to get acquainted.
# from the code above, we know the table is called 'facts'
q2 = 'SELECT * FROM facts limit 5;'

pd.read_sql_query(q2,conn)

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate
0,1,af,Afghanistan,652230,652230,0,32564342,2.32,38.57,13.89,1.51
1,2,al,Albania,28748,27398,1350,3029278,0.30,12.92,6.58,3.30
2,3,ag,Algeria,2381741,2381741,0,39542166,1.84,23.67,4.31,0.92
3,4,an,Andorra,468,468,0,85580,0.12,8.13,6.96,0.00
4,5,ao,Angola,1246700,1246700,0,19625353,2.78,38.78,11.49,0.46